"""
ЗАДАНИЕ
--------------------------------------------------------------------------------
Написать функцию, которая вернет результат сложения цифр целого числа

ПРИМЕРЫ
--------------------------------------------------------------------------------
num_sum(5216) -> 14
num_sum(58716) -> 27
num_sum(321) -> 6
"""


def num_sum(numb: int) -> int:
    num_str = str(numb)
    result = 0
    for number in num_str:
        result += int(number)
    return result


if __name__ == '__main__':
    assert num_sum(5216) == 14
    print('Решено!')
